# Fun
> x -> x
: @a. a -> a

> (x : Int) -> x
: Int -> Int

> x -> (x : Int)
: Int -> Int

# App
> (x -> x)(1)
1

> ((x, y) -> (y, x))(1, 2)
(2, 1)

> ((x, y) -> ((x, y) -> (x, y))(y, x))(1, 2)
(2, 1)
