p = (10, 20)

# Property-like access
> p.1
10

> p.2
20

# Trait-like access
> .1 p
10

> .2 p
20

